#include "head.h"
int page() {
	int i;
	do {
		system("cls");
		system("color F0");
		printf(" ________________________________________________________________\n");
		printf("|                      约瑟夫生死者游戏                          |\n");
		printf("|请您选择游玩模式：                                              |\n");
		printf("|                1 参与者模式    2 参观者模式                    |\n");
		printf("|                3 历史记录      0 退出游玩                      |\n");
		printf("|________________________________________________________________|\n");
		printf("请输入选择：\n");
		scanf("%d", &i);
		while (getchar() != '\n');
	} while (!(i >= 0 && i <= 3));
	return i;
}
void pagev(int &i) {
	do {
		printf(" ________________________________________________________________\n");
		printf("|参观者模式->                                                    |\n");
		printf("|请您选择每个人的密码：                                          |\n");
		printf("|                1手动输入         0系统随机                     |\n");
		printf("|________________________________________________________________|\n");
		printf("请输入选择(1or0)：\n");
		scanf("%d", &i);
	} while (!(i == 0 || i == 1));
}